package Vlad.Inet.arrays;

/**
 * Created by Гудвін on 02.08.2016.
 * Программа должна создать массив из 12 случайных целых чисел из отрезка [-10;10] таким образом,
 * чтобы отрицательных и положительных элементов там было поровну и не было нулей.
 * При этом порядок следования элементов должен быть случаен
 * (т. е. не подходит вариант, когда в массиве постоянно выпадает сначала 6 положительных, а потом 6 отрицательных чисел или
 * же когда элементы постоянно чередуются через один и пр.). Вывести полученный массив на экран.
 */
public class task12 {
}
